In [1]:
import pandas as pd, numpy as np

In [2]:
import sys
sys.path.append('./')
from process_acs import *
from process_decennial import *
from sample_data import *

# Test age sampling functions from ACS and Decennial datasets

In [3]:
%%time

asian_decennial = read_decennial()

CPU times: user 51.2 s, sys: 10.4 s, total: 1min 1s
Wall time: 1min 3s

In [4]:
asian_decennial.head()

        pop_count  age_start  age_end  sex_id          geoid
391148          0          0        4       1  5319501001000
391149          0          0        4       1  5319501001001
391150          0          0        4       1  5319501001002
391151          0          0        4       1  5319501001003
391152          0          0        4       1  5319501001004

In [5]:
acs_wa2015 = load_incoming_data('ss15pwa.csv', 2015)
acs_wa2015 = format_acs(acs_wa2015, ['racasn'], 2015)
acs_wa2015 = add_decennial_age_bins(acs_wa2015)

In [6]:
acs_wa2015.head()

,state,year,sex_id,age,racaian,racasn,racblk,racnhpi,racsor,racwht,race_count,pop_count,age_start,age_end,pop_proportion
124,WA,2015,1,0,0,1,0,0,0,0,1,2293,0,4,0.156231
799,WA,2015,1,1,0,1,0,0,0,0,1,4454,0,4,0.303468
138,WA,2015,1,2,0,1,0,0,0,0,1,3074,0,4,0.209443
3884,WA,2015,1,3,0,1,0,0,0,0,1,2825,0,4,0.192478
123,WA,2015,1,4,0,1,0,0,0,0,1,2031,0,4,0.138380

In [7]:
# check proportions sum to 1
acs_wa2015.groupby(['sex_id','age_start','age_end']).sum().pop_proportion.unique()

array([1., 1.])

In [8]:
long_df = asian_decennial[asian_decennial.pop_count!=0].iloc[:100]
long_df.head()

        pop_count  age_start  age_end  sex_id         geoid
394202          2          0        4       1  535102011031
394278          3          0        4       1  535102012022
394353          3          0        4       1  535102022012
394384         23          0        4       1  535102024003
395264          2          0        4       1  535108033000

In [9]:
single_years_df = generate_single_year_df(long_df, age_distribution=acs_wa2015)

/ihme/homes/beatrixh/june_repo/explore_census_2020_dp/explore/binning/sample_data.py:28: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[var] = 0

In [12]:
single_years_df.head()

          geoid  sex_id  age  pop_count
0  535102011031       1    0          1
1  535102012022       1    0          2
2  535102022012       1    0          3
3  535102024003       1    0          4
4  535108033000       1    0          0